In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('loan_approval_dataset.csv')

In [3]:
df.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value,loan_status
0,1,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,4,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

In [4]:
df.shape

(4269, 13)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4269 entries, 0 to 4268
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   loan_id                    4269 non-null   int64
 1    no_of_dependents          4269 non-null   int64
 2    education                 4269 non-null   object
 3    self_employed             4269 non-null   object
 4    income_annum              4269 non-null   int64
 5    loan_amount               4269 non-null   int64
 6    loan_term                 4269 non-null   int64
 7    cibil_score               4269 non-null   int64
 8    residential_assets_value  4269 non-null   int64
 9    commercial_assets_value   4269 non-null   int64
 10   luxury_assets_value       4269 non-null   int64
 11   bank_asset_value          4269 non-null   int64
 12   loan_status               4269 non-null   object
dtypes: int64(10), object(3)
memory usage: 433.7+ KB

In [6]:
df.describe()

,loan_id,no_of_dependents,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value
count,4269.000000,4269.000000,4.269000e+03,4.269000e+03,4269.000000,4269.000000,4.269000e+03,4.269000e+03,4.269000e+03,4.269000e+03
mean,2135.000000,2.498712,5.059124e+06,1.513345e+07,10.900445,599.936051,7.472617e+06,4.973155e+06,1.512631e+07,4.976692e+06
std,1232.498479,1.695910,2.806840e+06,9.043363e+06,5.709187,172.430401,6.503637e+06,4.388966e+06,9.103754e+06,3.250185e+06
min,1.000000,0.000000,2.000000e+05,3.000000e+05,2.000000,300.000000,-1.000000e+05,0.000000e+00,3.000000e+05,0.000000e+00
25%,1068.000000,1.000000,2.700000e+06,7.700000e+06,6.000000,453.000000,2.200000e+06,1.300000e+06,7.500000e+06,2.300000e+06
50%,2135.000000,3.000000,5.100000e+06,1.450000e+07,10.000000,600.000000,5.600000e+06,3.700000e+06,1.460000e+07,4.600000e+06
75%,3202.000000,4.000000,7.500000e+06,2.150000e+07,16.000000,748.000000,1.130000e+07,7.600000e+06,2.170000e+07,7.100000e+06
max,4269.000000,5.000000,9.900000e+06,3.950000e+07,20.000000,900.000000,2.910000e+07,1.940000e+07,3.920000e+07,1.470000e+07

In [7]:
df.columns

Index(['loan_id', ' no_of_dependents', ' education', ' self_employed',
       ' income_annum', ' loan_amount', ' loan_term', ' cibil_score',
       ' residential_assets_value', ' commercial_assets_value',
       ' luxury_assets_value', ' bank_asset_value', ' loan_status'],
      dtype='object')

In [8]:
df[' education'].value_counts()

 Graduate        2144
 Not Graduate    2125
Name:  education, dtype: int64

In [9]:
df[' no_of_dependents'].value_counts()

4    752
3    727
0    712
2    708
1    697
5    673
Name:  no_of_dependents, dtype: int64

In [10]:
df.corr()

C:\Users\Anonymous\AppData\Local\Temp\ipykernel_6528\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

,loan_id,no_of_dependents,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value
loan_id,1.000000,0.005326,0.012592,0.008170,0.009809,0.016323,0.020936,0.018595,-0.000862,0.010765
no_of_dependents,0.005326,1.000000,0.007266,-0.003366,-0.020111,-0.009998,0.007376,-0.001531,0.002817,0.011163
income_annum,0.012592,0.007266,1.000000,0.927470,0.011488,-0.023034,0.636841,0.640328,0.929145,0.851093
loan_amount,0.008170,-0.003366,0.927470,1.000000,0.008437,-0.017035,0.594596,0.603188,0.860914,0.788122
loan_term,0.009809,-0.020111,0.011488,0.008437,1.000000,0.007810,0.008016,-0.005478,0.012490,0.017177
cibil_score,0.016323,-0.009998,-0.023034,-0.017035,0.007810,1.000000,-0.019947,-0.003769,-0.028618,-0.015478
residential_assets_value,0.020936,0.007376,0.636841,0.594596,0.008016,-0.019947,1.000000,0.414786,0.590932,0.527418
commercial_assets_value,0.018595,-0.001531,0.640328,0.603188,-0.005478,-0.003769,0.414786,1.000000,0.591128,0.548576
luxury_assets_value,-0.000862,0.002817,0.929145,0.860914,0.012490,-0.028618,0.590932,0.591128,1.000000,0.788517
bank_asset_value,0.010765,0.011163,0.851093,0.788122,0.017177,-0.015478,0.527418,0.548576,0.788517,1.000000

In [11]:
df[' income_annum'].max()

9900000

In [12]:
df.nunique()

loan_id                      4269
 no_of_dependents               6
 education                      2
 self_employed                  2
 income_annum                  98
 loan_amount                  378
 loan_term                     10
 cibil_score                  601
 residential_assets_value     278
 commercial_assets_value      188
 luxury_assets_value          379
 bank_asset_value             146
 loan_status                    2
dtype: int64

In [13]:
df.duplicated().sum()

0

#### Removing the whitespaces

In [14]:
df.columns

Index(['loan_id', ' no_of_dependents', ' education', ' self_employed',
       ' income_annum', ' loan_amount', ' loan_term', ' cibil_score',
       ' residential_assets_value', ' commercial_assets_value',
       ' luxury_assets_value', ' bank_asset_value', ' loan_status'],
      dtype='object')

In [15]:
df.columns=[col.strip() for col in df.columns]

In [16]:
df.columns

Index(['loan_id', 'no_of_dependents', 'education', 'self_employed',
       'income_annum', 'loan_amount', 'loan_term', 'cibil_score',
       'residential_assets_value', 'commercial_assets_value',
       'luxury_assets_value', 'bank_asset_value', 'loan_status'],
      dtype='object')

#### Seperating the x and y

In [17]:
x = df.drop(columns='loan_status')
y = df['loan_status']

In [18]:
x

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value
0,1,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000
2,3,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000
3,4,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000
...,...,...,...,...,...,...,...,...,...,...,...,...
4264,4265,5,Graduate,Yes,1000000,2300000,12,317,2800000,500000,3300000,800000
4265,4266,0,Not Graduate,Yes,3300000,11300000,20,559,4200000,2900000,11000000,1900000
4266,4267,2,Not Graduate,No,6500000,23900000,18,457,1200000,12400000,18100000,7300000
4267,4268,1,Not Graduate,No,4100000,12800000,8,780,8200000,700000,14100000,5800000
4268,4269,1,Graduate,No,9200000,29700000,10,607,17800000,11800000,35700000,12000000

In [19]:
y = df['loan_status']

In [20]:
type(y)

pandas.core.series.Series

In [21]:
type(x)

pandas.core.frame.DataFrame

#### Preprocessing

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4269 entries, 0 to 4268
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   loan_id                   4269 non-null   int64
 1   no_of_dependents          4269 non-null   int64
 2   education                 4269 non-null   object
 3   self_employed             4269 non-null   object
 4   income_annum              4269 non-null   int64
 5   loan_amount               4269 non-null   int64
 6   loan_term                 4269 non-null   int64
 7   cibil_score               4269 non-null   int64
 8   residential_assets_value  4269 non-null   int64
 9   commercial_assets_value   4269 non-null   int64
 10  luxury_assets_value       4269 non-null   int64
 11  bank_asset_value          4269 non-null   int64
 12  loan_status               4269 non-null   object
dtypes: int64(10), object(3)
memory usage: 433.7+ KB

### Apply the domain knowledge

In [23]:
x['total_asset_value']=x['residential_assets_value']+x['commercial_assets_value']+x['luxury_assets_value']+x['bank_asset_value']
x.drop(columns=['residential_assets_value','commercial_assets_value','luxury_assets_value','bank_asset_value'],inplace=True)

In [24]:
x.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,total_asset_value
0,1,2,Graduate,No,9600000,29900000,12,778,50700000
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,17000000
2,3,3,Graduate,No,9100000,29700000,20,506,57700000
3,4,3,Graduate,No,8200000,30700000,8,467,52700000
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,55000000

#### convert the categorical columns to numerical columns

In [25]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4269 entries, 0 to 4268
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   loan_id            4269 non-null   int64
 1   no_of_dependents   4269 non-null   int64
 2   education          4269 non-null   object
 3   self_employed      4269 non-null   object
 4   income_annum       4269 non-null   int64
 5   loan_amount        4269 non-null   int64
 6   loan_term          4269 non-null   int64
 7   cibil_score        4269 non-null   int64
 8   total_asset_value  4269 non-null   int64
dtypes: int64(7), object(2)
memory usage: 300.3+ KB

In [26]:
x['education'].value_counts()

 Graduate        2144
 Not Graduate    2125
Name: education, dtype: int64

In [27]:
x['self_employed'].value_counts()

 Yes    2150
 No     2119
Name: self_employed, dtype: int64

##### some spacing issue below

In [28]:
x['education'].unique()

array([' Graduate', ' Not Graduate'], dtype=object)

##### we can see same spacing issue here

In [29]:
y.unique()

array([' Approved', ' Rejected'], dtype=object)

##### removing white spaces from values

In [30]:
x['education']=x['education'].str.strip()
x['self_employed']=x['self_employed'].str.strip()

In [31]:
x['education'].unique()

array(['Graduate', 'Not Graduate'], dtype=object)

In [32]:
y.unique()

array([' Approved', ' Rejected'], dtype=object)

In [33]:
y=y.str.strip()

In [34]:
y.unique()

array(['Approved', 'Rejected'], dtype=object)

#### Convert the columns into numerical format

In [35]:
def transform_cat_to_num(df,columns_to_transform):
    for cols,positives in columns_to_transform.items():
        df[cols]=df[cols].apply(lambda x: 1 if x in positives else 0)

    return df

In [36]:
columns_to_transform={
    'education':['Graduate'],
    'self_employed':['Yes']
}

In [37]:
transformed_X = transform_cat_to_num(x,columns_to_transform)

In [38]:
transformed_X.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,total_asset_value
0,1,2,1,0,9600000,29900000,12,778,50700000
1,2,0,0,1,4100000,12200000,8,417,17000000
2,3,3,1,0,9100000,29700000,20,506,57700000
3,4,3,1,0,8200000,30700000,8,467,52700000
4,5,5,0,1,9800000,24200000,20,382,55000000

In [39]:
x['education'].unique()

array([1, 0], dtype=int64)

### Scaling of dataset -> log transformation

In [41]:
transformed_X.head(2)

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,total_asset_value
0,1,2,1,0,9600000,29900000,12,778,50700000
1,2,0,0,1,4100000,12200000,8,417,17000000

In [42]:
log_cols = ['income_annum','loan_amount','total_asset_value']
transformed_X[log_cols] = np.log(transformed_X[log_cols])

In [43]:
y=y.map({"Approved":1,"Rejected":0})

In [44]:
y[:5]

0    1
1    0
2    0
3    0
4    0
Name: loan_status, dtype: int64

In [45]:
transformed_X

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,total_asset_value
0,1,2,1,0,16.077274,17.213369,12,778,17.741436
1,2,0,0,1,15.226498,16.316947,8,417,16.648724
2,3,3,1,0,16.023785,17.206658,20,506,17.870768
3,4,3,1,0,15.919645,17.239773,8,467,17.780126
4,5,5,0,1,16.097893,17.001863,20,382,17.822844
...,...,...,...,...,...,...,...,...,...
4264,4265,5,1,1,13.815511,14.648420,12,317,15.816991
4265,4266,0,0,1,15.009433,16.240313,20,559,16.811243
4266,4267,2,0,0,15.687313,16.989389,18,457,17.479072
4267,4268,1,0,0,15.226498,16.364956,8,780,17.175886
4268,4269,1,1,0,16.034714,17.206658,10,607,18.163205

In [46]:
transformed_X.drop(columns='loan_id',inplace=True)

In [47]:
transformed_X

,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,total_asset_value
0,2,1,0,16.077274,17.213369,12,778,17.741436
1,0,0,1,15.226498,16.316947,8,417,16.648724
2,3,1,0,16.023785,17.206658,20,506,17.870768
3,3,1,0,15.919645,17.239773,8,467,17.780126
4,5,0,1,16.097893,17.001863,20,382,17.822844
...,...,...,...,...,...,...,...,...
4264,5,1,1,13.815511,14.648420,12,317,15.816991
4265,0,0,1,15.009433,16.240313,20,559,16.811243
4266,2,0,0,15.687313,16.989389,18,457,17.479072
4267,1,0,0,15.226498,16.364956,8,780,17.175886
4268,1,1,0,16.034714,17.206658,10,607,18.163205

In [48]:
y

0       1
1       0
2       0
3       0
4       0
       ..
4264    0
4265    1
4266    0
4267    1
4268    1
Name: loan_status, Length: 4269, dtype: int64

### Building the model

In [49]:
from sklearn.model_selection import train_test_split

In [50]:
x_train,x_test,y_train,y_test = train_test_split(transformed_X,y,test_size=0.3,random_state=0)

In [51]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

In [53]:
model.fit(x_train,y_train)

c:\Users\Anonymous\anaconda3\Lib\site-packages\sklearn\linear_model\_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [55]:
y_pred_test = model.predict(x_test)

In [57]:
from sklearn.metrics import accuracy_score
accuracy=accuracy_score(y_test,y_pred_test)
print(f"Accuracy is given by {accuracy}")

Accuracy is given by 0.9039812646370023

### Serialization and Deserialization

In [59]:
# Serialization
import joblib
joblib.dump(model,"my_trained_model_v001.pkl")

['my_trained_model_v001.pkl']

In [60]:
# Deserialization
final_model = joblib.load('my_trained_model_v001.pkl')

In [61]:
final_model.intercept_

array([-3.57933108])

In [62]:
final_model.coef_

array([[-0.02167354,  0.02973055, -0.01842534, -3.12510583,  2.4159849 ,
        -0.15763661,  0.02329093,  0.07750162]])

### Packcage and modules